In [75]:
import pandas as pd
import numpy as np

In [76]:
majors = pd.read_csv("../csv/majors.csv")

In [77]:
#majors

In [78]:
majors.drop(list(majors)[4:35], axis=1, inplace=True)

In [79]:
majors

     type     id                              name    cp
0     cbk  90417  Switzerland Language and Culture  32.0
1     cbk  90480      Chinese Language and Culture  32.0
2     cbk  90481     Japanese Language and Culture  32.0
3     cbk  90483       French Language and Culture  32.0
4     cbk  90484      Spanish Language and Culture  32.0
...   ...    ...                               ...   ...
1318  NaN  97808     Italian Language and the Arts   8.0
1319  NaN  99021  International Exchange Subject 1   6.0
1320  NaN  99022  International Exchange Subject 2   6.0
1321  NaN  99023  International Exchange Subject 3   6.0
1322  NaN  99024  International Exchange Subject 4   6.0

[1323 rows x 4 columns]

In [80]:
majors = majors.reindex(columns=["id","name","type","cp"])
majors.set_index('id')

                                   name type    cp course_id
id
90417  Switzerland Language and Culture  cbk  32.0
90480      Chinese Language and Culture  cbk  32.0
90481     Japanese Language and Culture  cbk  32.0
90483       French Language and Culture  cbk  32.0
90484      Spanish Language and Culture  cbk  32.0
...                                 ...  ...   ...       ...
97808     Italian Language and the Arts  NaN   8.0
99021  International Exchange Subject 1  NaN   6.0
99022  International Exchange Subject 2  NaN   6.0
99023  International Exchange Subject 3  NaN   6.0
99024  International Exchange Subject 4  NaN   6.0

[1323 rows x 4 columns]

In [81]:
majors.to_csv("../csv/sub_structures.csv", sep=',', index=False)